# Ex3 - Obtener y conocer sus datos

### Paso 1. Importar las bibliotecas necesarias

In [1]:
import pandas as pd

### Paso 2. Importe el conjunto de datos desde esta [dirección](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Paso 3. Asígnalo a una variable llamada users y usa el 'user_id' como índice

In [9]:
users = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', sep='|', index_col= 'user_id')
users

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

In [8]:
users['user_id']

users.set_index(users['user_id'].values)

     user_id  age gender     occupation zip_code
1          1   24      M     technician    85711
2          2   53      F          other    94043
3          3   23      M         writer    32067
4          4   24      M     technician    43537
5          5   33      F          other    15213
..       ...  ...    ...            ...      ...
939      939   26      F        student    33319
940      940   32      M  administrator    02215
941      941   20      M        student    97229
942      942   48      F      librarian    78209
943      943   22      M        student    77841

[943 rows x 5 columns]

### Paso 4. Ver las 25 primeras entradas
Resuélvelo de 2 maneras diferentes

In [10]:
users[:25]

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

### Paso 5. Ver las 10 últimas entradas

In [11]:
users[:]

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213
...      ...    ...         ...      ...
929       44      M   scientist    53711
930       28      F   scientist    07310
931       60      M    educator    33556
932       58      M    educator    06437
933       28      M     student    48105

[933 rows x 4 columns]

### Paso 6. ¿Cuál es el número de observaciones del conjunto de datos?
Resuélvelo de 2 formas diferentes

### Paso 7. ¿Cuál es el número de columnas del conjunto de datos?
Resuélvelo de 2 formas diferentes

### Paso 8. Imprime el nombre de todas las columnas.

### Paso 9. ¿Cómo se indexa el conjunto de datos? Obtener los valores del índice

### Paso 10. ¿Cuál es el tipo de datos de cada columna?
Resuélvelo de 2 formas diferentes

### Paso 11. Imprime sólo la columna de ocupación
Resuélvelo de 2 formas diferentes

### Paso 12. ¿Cuántas ocupaciones diferentes hay en este conjunto de datos? ¿Cuántos usuarios por ocupación hay en el conjunto de datos?

### Paso 13. ¿Cuál es la ocupación más frecuente?

### Paso 14. Resuma el DataFrame.

### Paso 15. Resuma todas las columnas

### Paso 16. Resuma sólo la columna de ocupación

### Paso 17. ¿Cuál es la edad media de los usuarios?

### Paso 18. ¿Cuál es la edad con menos ocurrencias?